app/controllers/tacos_controller.rb

SELECT "tacos".* FROM "tacos"
---
  def index
    @taco = Taco.all

INSERT INTO "tacos" ("meat", "rice", "salsa", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["meat", "chicken"], ["rice", "f"], ["salsa", "f"], ["notes", ""], ["created_at", "2017-05-12 17:13:57.623629"], ["updated_at", "2017-05-12 17:13:57.623629"]]
---
  def create
    @taco = Taco.new(taco_params)
    @taco.save

SELECT  "tacos".* FROM "tacos" WHERE "tacos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tacos" WHERE "tacos"."id" = ?  [["id", 1]]
---
  def destroy
    @taco = Taco.find(params[:id])
    @taco.destroy